ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/DMASS0_RINGACC_0_RINGACC_SRC_FIFOS.xml
<module name="DMASS0_RINGACC_0_RINGACC_SRC_FIFOS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="RINGACC__SRC__FIFOS_RING_HEAD_DATA" acronym="RINGACC__SRC__FIFOS_RING_HEAD_DATA" offset="0x0" width="32" description="The Ring Head Entry Data Registers contain the data which is to be written or which was read from the ring head.  These registers are virtual and non-static (i.e. they are just address locations that are used to access the ring head element for reads or writes. The data is right justified.)">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Block of ring head or tail element data" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC__SRC__FIFOS_RING_TAIL_DATA" acronym="RINGACC__SRC__FIFOS_RING_TAIL_DATA" offset="0x200" width="32" description="The Ring Tail Entry Data Registers contain the data which is to be written or which was read from the ring tail.  These registers are virtual and non-static (i.e. they are just address locations that are used to access the ring tail element for reads or writes. The data is right justified.)">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Block of ring head or tail element data" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC__SRC__FIFOS_PEEK_HEAD_DATA" acronym="RINGACC__SRC__FIFOS_PEEK_HEAD_DATA" offset="0x400" width="32" description="The Ring Peek Head Entry Data Registers contain the data which is to be read from the ring head without removing the element.  These registers are virtual and non-static (i.e. they are just address locations that are used to access the ring head element for reads. Writes are ignored. The data is right justified.)">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Block of ring head or tail element data. Reserved for rings in ring mode." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC__SRC__FIFOS_PEEK_TAIL_DATA" acronym="RINGACC__SRC__FIFOS_PEEK_TAIL_DATA" offset="0x600" width="32" description="The Ring Peek Tail Entry Data Registers contain the data which is to be read from the ring tail without removing the element.  These registers are virtual and non-static (i.e. they are just address locations that are used to access the ring tail element for reads. Writes are ignored. The data is right justified.)">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Block of ring head or tail element data. Reserved for rings in ring mode." range="31 - 0" rwaccess="R/W"/>
	</register>
</module>